Repository: NicolasR27/AIKit
Catalog: Packages/AIKit/Sources/AIKit/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, fr, it

source: AI Providers
de: KI-Anbieter
es: Proveedores de IA
fr: Fournisseurs d'IA
it: Provider di IA

source: API Key
de: API-Schlüssel
es: Clave de API
fr: Clé API
it: Chiave API

source: API key
de: API-Schlüssel
es: Clave de API
fr: Clé API
it: Chiave API

source: API keys are stored in your device's Keychain and are only sent to the provider they belong to.
de: API-Schlüssel werden im Schlüsselbund deines Geräts gespeichert und nur an den Anbieter gesendet, zu dem sie gehören.
es: Las claves de API se guardan en el llavero de tu dispositivo y solo se envían al proveedor al que pertenecen.
fr: Les clés API sont stockées dans le trousseau de votre appareil et ne sont envoyées qu'au fournisseur auquel elles appartiennent.
it: Le chiavi API sono salvate nel portachiavi del dispositivo e vengono inviate solo al provider a cui appartengono.

source: Apple Intelligence can't read photos on this device. Choose a cloud provider in AI provider settings.
de: Apple Intelligence kann auf diesem Gerät keine Fotos lesen. Wähle in den KI-Anbieter-Einstellungen einen Cloud-Anbieter.
es: Apple Intelligence no puede leer fotos en este dispositivo. Elige un proveedor en la nube en los ajustes de proveedores de IA.
fr: Apple Intelligence ne peut pas lire les photos sur cet appareil. Choisissez un fournisseur cloud dans les réglages des fournisseurs d'IA.
it: Apple Intelligence non può leggere le foto su questo dispositivo. Scegli un provider cloud nelle impostazioni dei provider di IA.

source: Apple Intelligence isn't available right now.
de: Apple Intelligence ist gerade nicht verfügbar.
es: Apple Intelligence no está disponible en este momento.
fr: Apple Intelligence n'est pas disponible pour le moment.
it: Apple Intelligence non è disponibile al momento.

source: Choose a model in AI provider settings first.
de: Wähle zuerst ein Modell in den KI-Anbieter-Einstellungen.
es: Primero elige un modelo en los ajustes de proveedores de IA.
fr: Choisissez d'abord un modèle dans les réglages des fournisseurs d'IA.
it: Prima scegli un modello nelle impostazioni dei provider di IA.

source: Claude models
de: Claude-Modelle
es: Modelos Claude
fr: Modèles Claude
it: Modelli Claude

source: Close
de: Schließen
es: Cerrar
fr: Fermer
it: Chiudi

source: Connect
de: Verbinden
es: Conectar
fr: Connecter
it: Connetti

source: Connect an AI provider in settings first.
de: Verbinde zuerst einen KI-Anbieter in den Einstellungen.
es: Primero conecta un proveedor de IA en los ajustes.
fr: Connectez d'abord un fournisseur d'IA dans les réglages.
it: Prima collega un provider di IA nelle impostazioni.

source: Connected
de: Verbunden
es: Conectado
fr: Connecté
it: Connesso

source: Couldn't reach the provider. %@
de: Der Anbieter ist nicht erreichbar. %@
es: No se pudo contactar con el proveedor. %@
fr: Impossible de joindre le fournisseur. %@
it: Impossibile raggiungere il provider. %@

source: Couldn't save to the Keychain (%@).
de: Speichern im Schlüsselbund fehlgeschlagen (%@).
es: No se pudo guardar en el llavero (%@).
fr: Impossible d'enregistrer dans le trousseau (%@).
it: Impossibile salvare nel portachiavi (%@).

source: Couldn't Sign In
de: Anmeldung fehlgeschlagen
es: No se pudo iniciar sesión
fr: Connexion impossible
it: Impossibile accedere

source: Creates a key in your OpenRouter account automatically. Or paste an existing key below.
de: Erstellt automatisch einen Schlüssel in deinem OpenRouter-Account. Oder füge unten einen vorhandenen Schlüssel ein.
es: Crea una clave en tu cuenta de OpenRouter automáticamente. O pega una clave existente abajo.
fr: Crée automatiquement une clé dans votre compte OpenRouter. Ou collez une clé existante ci-dessous.
it: Crea automaticamente una chiave nel tuo account OpenRouter. Oppure incolla una chiave esistente qui sotto.

source: Current AI
de: Aktuelle KI
es: IA actual
fr: IA actuelle
it: IA attuale

source: Default
de: Standard
es: Predeterminado
fr: Par défaut
it: Predefinito

source: Default Provider
de: Standardanbieter
es: Proveedor predeterminado
fr: Fournisseur par défaut
it: Provider predefinito

source: Disconnect
de: Trennen
es: Desconectar
fr: Déconnecter
it: Disconnetti

source: Disconnect %@?
de: %@ trennen?
es: ¿Desconectar %@?
fr: Déconnecter %@ ?
it: Disconnettere %@?

source: Download Ollama
de: Ollama herunterladen
es: Descargar Ollama
fr: Télécharger Ollama
it: Scarica Ollama

source: Enter an API key first.
de: Gib zuerst einen API-Schlüssel ein.
es: Primero introduce una clave de API.
fr: Saisissez d'abord une clé API.
it: Prima inserisci una chiave API.

source: Gemini models
de: Gemini-Modelle
es: Modelos Gemini
fr: Modèles Gemini
it: Modelli Gemini

source: Get your %@ API key
de: API-Schlüssel für %@ erhalten
es: Obtén tu clave de API de %@
fr: Obtenir votre clé API %@
it: Ottieni la tua chiave API di %@

source: GPT models
de: GPT-Modelle
es: Modelos GPT
fr: Modèles GPT
it: Modelli GPT

source: Hide Key
de: Schlüssel ausblenden
es: Ocultar clave
fr: Masquer la clé
it: Nascondi chiave

source: Hundreds of models, one key
de: Hunderte Modelle, ein Schlüssel
es: Cientos de modelos, una sola clave
fr: Des centaines de modèles, une seule clé
it: Centinaia di modelli, una sola chiave

source: Mistral & Codestral models
de: Mistral- und Codestral-Modelle
es: Modelos Mistral y Codestral
fr: Modèles Mistral et Codestral
it: Modelli Mistral e Codestral

source: Model
de: Modell
es: Modelo
fr: Modèle
it: Modello

source: Models running on your own machine
de: Modelle, die auf deinem eigenen Rechner laufen
es: Modelos que se ejecutan en tu propio equipo
fr: Modèles exécutés sur votre propre machine
it: Modelli in esecuzione sul tuo computer

source: No Models
de: Keine Modelle
es: No hay modelos
fr: Aucun modèle
it: Nessun modello

source: None
de: Ohne
es: Ninguno
fr: Aucun
it: Nessuno

source: Not Connected
de: Nicht verbunden
es: No conectado
fr: Non connecté
it: Non connesso

source: Not Set Up
de: Nicht eingerichtet
es: Sin configurar
fr: Non configuré
it: Non configurato

source: On-device model
de: Modell auf dem Gerät
es: Modelo en el dispositivo
fr: Modèle sur l'appareil
it: Modello sul dispositivo

source: On-device, private, no key needed
de: Auf dem Gerät, privat, kein Schlüssel nötig
es: En el dispositivo, privado, sin clave
fr: Sur l'appareil, privé, sans clé
it: Sul dispositivo, privato, nessuna chiave richiesta

source: OpenRouter couldn't finish signing you in.
de: OpenRouter konnte die Anmeldung nicht abschließen.
es: OpenRouter no pudo completar el inicio de sesión.
fr: OpenRouter n'a pas pu finaliser votre connexion.
it: OpenRouter non è riuscito a completare l'accesso.

source: OpenRouter didn't return a sign-in code. Please try again.
de: OpenRouter hat keinen Anmeldecode zurückgegeben. Bitte versuche es erneut.
es: OpenRouter no devolvió un código de inicio de sesión. Inténtalo de nuevo.
fr: OpenRouter n'a pas renvoyé de code de connexion. Veuillez réessayer.
it: OpenRouter non ha restituito un codice di accesso. Riprova.

source: Providers
de: Anbieter
es: Proveedores
fr: Fournisseurs
it: Provider

source: Run Ollama on a computer on your network. From another device, use that computer's local IP address instead of localhost.
de: Führe Ollama auf einem Computer in deinem Netzwerk aus. Verwende auf einem anderen Gerät statt localhost die lokale IP-Adresse dieses Computers.
es: Ejecuta Ollama en un equipo de tu red. Desde otro dispositivo, usa la dirección IP local de ese equipo en lugar de localhost.
fr: Exécutez Ollama sur un ordinateur de votre réseau. Depuis un autre appareil, utilisez l'adresse IP locale de cet ordinateur au lieu de localhost.
it: Esegui Ollama su un computer della tua rete. Da un altro dispositivo, usa l'indirizzo IP locale di quel computer invece di localhost.

source: Runs on this device. Your requests never leave it and there's nothing to pay.
de: Läuft auf diesem Gerät. Deine Anfragen verlassen es nie und es fallen keine Kosten an.
es: Se ejecuta en este dispositivo. Tus solicitudes nunca salen de él y no hay nada que pagar.
fr: S'exécute sur cet appareil. Vos requêtes ne le quittent jamais et il n'y a rien à payer.
it: Funziona su questo dispositivo. Le tue richieste non lo lasciano mai e non c'è nulla da pagare.

source: Saved key %@
de: Gespeicherter Schlüssel %@
es: Clave guardada %@
fr: Clé enregistrée %@
it: Chiave salvata %@

source: Search models
de: Modelle durchsuchen
es: Buscar modelos
fr: Rechercher des modèles
it: Cerca modelli

source: Show Key
de: Schlüssel einblenden
es: Mostrar clave
fr: Afficher la clé
it: Mostra chiave

source: Sign in with OpenRouter
de: Mit OpenRouter anmelden
es: Iniciar sesión con OpenRouter
fr: Se connecter avec OpenRouter
it: Accedi con OpenRouter

source: Signing In…
de: Anmeldung …
es: Iniciando sesión…
fr: Connexion…
it: Accesso in corso…

source: Test Connection
de: Verbindung testen
es: Probar conexión
fr: Tester la connexion
it: Verifica connessione

source: Test the connection again to refresh the list.
de: Teste die Verbindung erneut, um die Liste zu aktualisieren.
es: Vuelve a probar la conexión para actualizar la lista.
fr: Testez à nouveau la connexion pour actualiser la liste.
it: Verifica di nuovo la connessione per aggiornare l'elenco.

source: That photo couldn't be read. Try a JPEG or PNG.
de: Das Foto konnte nicht gelesen werden. Versuche es mit einem JPEG oder PNG.
es: No se pudo leer esa foto. Prueba con un JPEG o PNG.
fr: Impossible de lire cette photo. Essayez un JPEG ou un PNG.
it: Impossibile leggere la foto. Prova con un JPEG o PNG.

source: That server address isn't a valid URL.
de: Diese Serveradresse ist keine gültige URL.
es: Esa dirección de servidor no es una URL válida.
fr: Cette adresse de serveur n'est pas une URL valide.
it: L'indirizzo del server non è un URL valido.

source: The AI provider returned an empty reply.
de: Der KI-Anbieter hat eine leere Antwort zurückgegeben.
es: El proveedor de IA devolvió una respuesta vacía.
fr: Le fournisseur d'IA a renvoyé une réponse vide.
it: Il provider di IA ha restituito una risposta vuota.

source: The app sends requests to this provider using your own account. You're billed by the provider, not by us.
de: Die App sendet Anfragen mit deinem eigenen Account an diesen Anbieter. Die Kosten rechnet der Anbieter ab, nicht wir.
es: La app envía las solicitudes a este proveedor con tu propia cuenta. Te factura el proveedor, no nosotros.
fr: L'app envoie les requêtes à ce fournisseur avec votre propre compte. C'est le fournisseur qui vous facture, pas nous.
it: L'app invia le richieste a questo provider usando il tuo account. Ti addebita il provider, non noi.

source: The conversation must end with a user message.
de: Die Unterhaltung muss mit einer Nachricht des Benutzers enden.
es: La conversación debe terminar con un mensaje del usuario.
fr: La conversation doit se terminer par un message de l'utilisateur.
it: La conversazione deve terminare con un messaggio dell'utente.

source: The on-device model is still downloading. Try again shortly.
de: Das Modell auf dem Gerät wird noch geladen. Versuche es gleich noch einmal.
es: El modelo del dispositivo aún se está descargando. Inténtalo de nuevo en breve.
fr: Le modèle sur l'appareil est encore en cours de téléchargement. Réessayez dans un instant.
it: Il modello sul dispositivo è ancora in download. Riprova tra poco.

source: The provider returned HTTP %lld.
de: Der Anbieter hat HTTP %lld zurückgegeben.
es: El proveedor devolvió HTTP %lld.
fr: Le fournisseur a renvoyé HTTP %lld.
it: Il provider ha restituito HTTP %lld.

source: This API key was rejected (%@).
de: Dieser API-Schlüssel wurde abgelehnt (%@).
es: Se rechazó esta clave de API (%@).
fr: Cette clé API a été refusée (%@).
it: Questa chiave API è stata rifiutata (%@).

source: This API key was rejected.
de: Dieser API-Schlüssel wurde abgelehnt.
es: Se rechazó esta clave de API.
fr: Cette clé API a été refusée.
it: Questa chiave API è stata rifiutata.

source: This device doesn't support Apple Intelligence.
de: Dieses Gerät unterstützt Apple Intelligence nicht.
es: Este dispositivo no es compatible con Apple Intelligence.
fr: Cet appareil ne prend pas en charge Apple Intelligence.
it: Questo dispositivo non supporta Apple Intelligence.

source: Turn on Apple Intelligence in Settings to use the on-device model.
de: Aktiviere Apple Intelligence in den Einstellungen, um das Modell auf dem Gerät zu verwenden.
es: Activa Apple Intelligence en Ajustes para usar el modelo del dispositivo.
fr: Activez Apple Intelligence dans Réglages pour utiliser le modèle sur l'appareil.
it: Attiva Apple Intelligence in Impostazioni per usare il modello sul dispositivo.

source: Unexpected response from the provider.
de: Unerwartete Antwort vom Anbieter.
es: Respuesta inesperada del proveedor.
fr: Réponse inattendue du fournisseur.
it: Risposta inattesa dal provider.

source: Use %@
de: %@ verwenden
es: Usar %@
fr: Utiliser %@
it: Usa %@

source: Use as Default
de: Als Standard verwenden
es: Usar como predeterminado
fr: Utiliser par défaut
it: Usa come predefinito

source: Verified %@.
de: Überprüft %@.
es: Verificado %@.
fr: Vérifié %@.
it: Verificato %@.

source: Your saved key will be removed from this device.
de: Dein gespeicherter Schlüssel wird von diesem Gerät entfernt.
es: Tu clave guardada se eliminará de este dispositivo.
fr: Votre clé enregistrée sera supprimée de cet appareil.
it: La chiave salvata verrà rimossa da questo dispositivo.

source: Your saved server and model will be removed from this device.
de: Dein gespeicherter Server und dein Modell werden von diesem Gerät entfernt.
es: Tu servidor y modelo guardados se eliminarán de este dispositivo.
fr: Votre serveur et votre modèle enregistrés seront supprimés de cet appareil.
it: Il server e il modello salvati verranno rimossi da questo dispositivo.

source: “%@” can't be used for chat. Choose a different model in AI provider settings.
de: „%@“ kann nicht für Chats verwendet werden. Wähle in den KI-Anbieter-Einstellungen ein anderes Modell.
es: «%@» no se puede usar para chatear. Elige otro modelo en los ajustes de proveedores de IA.
fr: « %@ » ne peut pas être utilisé pour discuter. Choisissez un autre modèle dans les réglages des fournisseurs d'IA.
it: «%@» non può essere usato per la chat. Scegli un altro modello nelle impostazioni dei provider di IA.

source: Server
es: Servidor
fr: Serveur

source: Server URL
es: URL del servidor
fr: URL du serveur
it: URL del server
